AUTO_config_TK_pesok/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеАссортимента</name>
  <registerRecords>InformationRegister.ОграничениеАссортимента</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВАссортимент</name>
    <comment>Дата ввода товар в ассортимент</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.АссортиментныйКомитет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйАссортимент</name>
      <comment>Товар вводится в базовый ассортимет</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАссортимента</name>
      <type>
        <types>CatalogRef.ВидыАссортимента</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеПлощадки</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование2</name>
    <comment>Локализованное наименование 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <comment>Основная единица измерения номенклатуры</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияУпаковки</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЯщиков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <comment>Тип номенклатуры</comment>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяМарка</name>
    <type>
      <types>CatalogRef.ТоварныеМарки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения по умолчанию</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияТовара</name>
    <comment>Срок хранения товара (в днях)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенообразования</name>
    <comment>Группа ценообразования</comment>
    <type>
      <types>CatalogRef.ГруппыЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>АкцизГруппа</name>
    <comment>Группа акциза</comment>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляБухгалтерии</name>
    <comment>Группа для бухгалтерии</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПланирования</name>
    <type>
      <types>CatalogRef.ТипНоменклатурыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАртикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИндикатива</name>
    <type>
      <types>CatalogRef.ТК_ТипыИндикатива</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеRB</name>
    <comment>Наименование  для Radio Beacon</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ТК_Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Товара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <comment>Состав набора</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <comment>Способ расчета цены реализации</comment>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/СкладыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладыКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСебестоимости</name>
    <comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>Тип цен розничной торговли (для розничного склада)</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <comment>Истина - склад розничный, иначе - оптовый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>CatalogRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Районы</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Устаревший, использовать вместо регистр &quot;ТК_УчетХарактеристикНаСкладах&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>(АСУ by 4ок)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если склад не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСкладТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСклад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Автомата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвтомата</name>
    <type>
      <types>CatalogRef.ВидыВендингАвтоматов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеЦены</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ИзменениеАссортимента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		// Склады из  Изменение ассортимента
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ИзменениеАссортимента";
		КомандаПечати.Идентификатор = "ИзменениеАссортиментаСклады";
		КомандаПечати.Представление = НСтр("ru = 'Список складов';uk='Список складів'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		КомандаПечати.СписокФорм = "ФормаДокумента";
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ДляВызоваИзДругихПодсистем
	// СтандартныеПодсистемы.УправлениеДоступом
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(ПодразделениеКомпании)";
		
		Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	#КонецОбласти
	
	
	
	
	
	
	
	#Область Проведение
	
	Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
		
		ИсточникиДанных = Новый Соответствие;
		
		Возврат ИсточникиДанных; 
		
	КонецФункции
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		Запрос = Новый Запрос;
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстыЗапроса = Новый СписокЗначений;
		ТекстЗапросаТаблицаЦеныНоменклатуры(Запрос, ТекстыЗапроса, Регистры);
		
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
	КонецПроцедуры
	
	Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
	КонецПроцедуры
	
	Функция ТекстЗапросаТаблицаЦеныНоменклатуры(Запрос, ТекстыЗапроса, Регистры)
		
		ИмяРегистра = "ОграничениеАссортимента";
		
		Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат "";
		КонецЕсли; 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ИзменениеАссортиментаТовары.Ссылка.ДатаВводаВАссортимент КАК Период,
		|	ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ИзменениеАссортиментаТовары.Номенклатура КАК Номенклатура,
		|	ИзменениеАссортиментаТовары.БазовыйАссортимент КАК БазовыйАссортимент,
		|	ИзменениеАссортиментаТовары.ВидАссортимента КАК ВидАссортимента,
		|	ВЫБОР
		|		КОГДА ИзменениеАссортиментаТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводТоваровВАссортимент)
		|			ТОГДА 1
		|		КОГДА ИзменениеАссортиментаТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента)
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Состояние
		|ИЗ
		|	Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары,
		|	Документ.ИзменениеАссортимента.ТорговыеПлощадки КАК ИзменениеАссортиментаТорговыеПлощадки
		|ГДЕ
		|	ИзменениеАссортиментаТовары.Ссылка = &Ссылка
		|	И ИзменениеАссортиментаТорговыеПлощадки.Ссылка = &Ссылка
		|	И НЕ ИзменениеАссортиментаТовары.Номенклатура = ЗНАЧЕНИЕ(справочник.Номенклатура.ПустаяСсылка)";
		
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы
	//
	// Параметры:
	//	Запрос				- Запрос - запрос, параметры которого предварительно установлены.
	//	ТекстыЗапроса		- Список значений - в списке перечислены тексты запросов и их имена.
	//	Таблицы				- Структура - структура в которую будут помещены полученные таблицы для движений.
	//	ДобавитьРазделитель	- Булево - Истина, если нужно добавить разделитель ";" между запросами.
	//	ДобавлятьСловоТаблица	- Булево - Истина, если к имени таблицы движений нужно вначало добавить слово "Таблица"
	//
	Процедура ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы, ДобавитьРазделитель = Ложь, ДобавлятьСловоТаблица = Истина, ТолькоОтмеченные=Ложь) Экспорт
		
		ТаблицыЗапроса = ОбщегоНазначенияТК.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, ДобавитьРазделитель);
		
		// Помещение результатов запроса в таблицы
		Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
			
			ИмяТаблицы = ТекстЗапроса.Представление;
			
			Если Не ПустаяСтрока(ИмяТаблицы) И (Не ТолькоОтмеченные Или ТекстЗапроса.Пометка) Тогда
				
				Если ДобавлятьСловоТаблица Тогда
					// Таблицы для проведения должны начинаться с "Таблица"
					Если НЕ СтрНачинаетсяС(ИмяТаблицы, "Таблица") Тогда
						ИмяТаблицы = "Таблица" + ИмяТаблицы;
					КонецЕсли;
				КонецЕсли;
				
				Таблицы.Вставить(ИмяТаблицы, ТаблицыЗапроса[ТекстЗапроса.Представление]);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	
	#Область Печать
	
	// Формирует печатные формы.
	//
	// Параметры:
	//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
	//  ПараметрыПечати - Структура - дополнительные настройки печати;
	//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
	//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
	//                                            представление - имя области, в которой был выведен объект (выходной параметр);
	//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//	ИзменениеАссортимента
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИзменениеАссортиментаСклады") Тогда    
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИзменениеАссортиментаСклады",
			НСтр("ru = 'Изменение ассортимента';uk='Зміна асортименту'"),
			ПечатьИзменениеАссортимента(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ИзменениеАссортимента.ПФ_MXL_ИзменениеАссортиментаСклады");
		КонецЕсли;	
		//ПечатьИзменениеАссортимента(МассивОбъектов, ОбъектыПечати);
	КонецПроцедуры
	
	//	ИзменениеАссортимента
	Функция ПечатьИзменениеАссортимента(МассивОбъектов, ОбъектыПечати)	Экспорт
		
		Док = МассивОбъектов[0];
		
		//Заполним параметры табличного документа
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИзменениеАссортимента";
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 0;
		ТабличныйДокумент.ПолеСлева  = 0;
		ТабличныйДокумент.ПолеСнизу  = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИзменениеАссортимента.ПФ_MXL_ИзменениеАссортиментаСклады");
		
		ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодразделение 	= Макет.ПолучитьОбласть("Подразделение");
		ОбластьШапка 			= Макет.ПолучитьОбласть("ШапкаТаблицы");	
		ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
		ОбластьАвтор			= Макет.ПолучитьОбласть("Автор");
		ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
		
		ПервыйДокумент = Истина;
		
		ЗаголовокЛок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 №%2 с %3'; uk = '%1 №%2 с %3'", КодЯзыкаПечать),
		СокрЛП(Док.ХозОперация),
		СокрЛП(Док.Номер),
		Формат(Док.ДатаВводаВАссортимент, "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		
		СтруктураШапки = Новый Структура;
		СтруктураШапки.Вставить("ТекстЗаголовка", ЗаголовокЛок);
		СтруктураШапки.Вставить("ПредставлениеПодразделения", Док.ПодразделениеКомпании);
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;				
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьПодразделение.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПодразделение);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		нпп		= 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Код КАК КодСклада,
		|	СкладыКомпании.Ссылка КАК Склад,
		|	СкладыКомпании.Маршрут КАК Маршрут,
		|	СкладыКомпании.АссортиментнаяМатрица КАК Матрица,
		|	ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка.Код КАК ПлощадкаКод
		|ИЗ
		|	Документ.ИзменениеАссортимента.ТорговыеПлощадки КАК ИзменениеАссортиментаТорговыеПлощадки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
		|		ПО ИзменениеАссортиментаТорговыеПлощадки.ТорговаяПлощадка = СкладыКомпании.ТорговаяПлощадка
		|			И (СкладыКомпании.АссортиментнаяМатрица <> ЗНАЧЕНИЕ(Справочник.АссортиментнаяМатрица.ПустаяСсылка))
		|ГДЕ
		|	ИзменениеАссортиментаТорговыеПлощадки.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			нпп = нпп + 1;			
			
			СтруктураСтроки = Новый Структура("КодСклада, Склад, Маршрут");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаДетальныеЗаписи);			
			
			СтруктураСтроки.Вставить("НомерСтроки", нпп);
			СтруктураСтроки.Вставить("ПредставлениеПлощадки", СокрЛП(ВыборкаДетальныеЗаписи.ТорговаяПлощадка)+", "+СокрЛП(ВыборкаДетальныеЗаписи.ПлощадкаКод));
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		СтруктураИтого = Новый Структура;	
		СтруктураИтого.Вставить("Всего", нпп);		
		
		ОбластьИтого.Параметры.Заполнить(СтруктураИтого);
		ТабличныйДокумент.Вывести(ОбластьИтого);		
		
		ОбластьАвтор.Параметры.Автор = Док.Автор;
		ТабличныйДокумент.Вывести(ОбластьАвтор);
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Док);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции
	
	#КонецОбласти	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
#КонецЕсли
